In [1]:
%load_ext sql

In [3]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [6]:
output = %sql SELECT * FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

In [7]:
type(output)

sql.run.ResultSet

In [8]:
import pandas as pd
df = pd.DataFrame(output)
df

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [19]:
%%sql
output2 <<
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.
Returning data to local variable output2

In [20]:
pd.DataFrame(output2) # notice the output has only 5 rows stored

   year code   pop   gdp  life  cell  imports  exports
0  1960  ABW  0.05   NaN  65.7   0.0      NaN      NaN
1  1960  AFG  9.00  0.54  32.3   0.0      NaN     49.9
2  1960  AGO  5.45   NaN  33.3   0.0    127.5    123.3
3  1960  ALB  1.61   NaN  62.3   0.0      NaN      NaN
4  1960  AND  0.01   NaN   NaN   0.0      NaN      NaN

In [22]:
%%sql
-- Here is a one-line comment
/* Here is a multi-line comment
which continues here
and ends here */
SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [24]:
%%sql
SELECT name FROM sqlite_master
WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [25]:
%%sql
--Explore tables
SELECT * FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [26]:
%%sql
--Explore tables
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]

In [4]:
%%sql
SELECT * FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1880, 'Male', 'John', 9655),
 (1881, 'Female', 'Mary', 6919),
 (1881, 'Male', 'John', 8769),
 (1882, 'Female', 'Mary', 8148)]

In [7]:
%%sql
-- what if you want to return only year and name columns in topnames?
SELECT year, name FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [8]:
%%sql
-- changing column names?
SELECT year AS myyear, name AS babyname FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [10]:
%%sql
-- filter the data to years post 2000 (2000 included)
SELECT * FROM topnames
WHERE year>=2000
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [17]:
%%sql
-- two conditions? return female baby names from post 2000 (including 2000)
-- python you use "&" for and; in SQL it is "AND"
-- python you use "|" for or; in SQL it is "OR"
SELECT * FROM topnames
WHERE year>=2000 AND sex='Female'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037)]

In [20]:
%%sql
-- more than two conditions?
-- return baby names post 2000 (included) and only the names "James" or "Emily"
SELECT * FROM topnames
WHERE year>=2000 AND (name='James' OR name='Emily')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037),
 (2005, 'Female', 'Emily', 23940),
 (2006, 'Female', 'Emily', 21404),
 (2007, 'Female', 'Emily', 19355)]

In [21]:
%%sql
-- do the same using the "isin()" approach from pandas
SELECT * FROM topnames
WHERE year>=2000 AND name IN ('James','Emily')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037),
 (2005, 'Female', 'Emily', 23940),
 (2006, 'Female', 'Emily', 21404),
 (2007, 'Female', 'Emily', 19355)]

In [26]:
%%sql
-- not equals in SQL?
-- return baby names that are not "John"
SELECT * FROM topnames
WHERE name != 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [27]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE name <> 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [28]:
%%sql
-- SQL way of doing it v2
SELECT * FROM topnames
WHERE name IS NOT 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [30]:
%%sql
-- return for years between 2000 and 2010
SELECT * FROM topnames
WHERE year<=2010 AND year>=2000
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [31]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE year BETWEEN 2000 AND 2010
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [36]:
%%sql
-- return baby names that start with "J"
SELECT * FROM topnames
WHERE name LIKE "J%"

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Male', 'John', 9655),
 (1881, 'Male', 'John', 8769),
 (1882, 'Male', 'John', 9557),
 (1883, 'Male', 'John', 8894),
 (1884, 'Male', 'John', 9388),
 (1885, 'Male', 'John', 8756),
 (1886, 'Male', 'John', 9026),
 (1887, 'Male', 'John', 8110),
 (1888, 'Male', 'John', 9247),
 (1889, 'Male', 'John', 8548),
 (1890, 'Male', 'John', 8502),
 (1891, 'Male', 'John', 7680),
 (1892, 'Male', 'John', 9039),
 (1893, 'Male', 'John', 8049),
 (1894, 'Male', 'John', 8238),
 (1895, 'Male', 'John', 8320),
 (1896, 'Male', 'John', 8138),
 (1897, 'Male', 'John', 7550),
 (1898, 'Male', 'John', 8159),
 (1899, 'Male', 'John', 6990),
 (1900, 'Male', 'John', 9829),
 (1901, 'Male', 'John', 6900),
 (1902, 'Male', 'John', 7907),
 (1903, 'Male', 'John', 7608),
 (1904, 'Male', 'John', 8108),
 (1905, 'Male', 'John', 8060),
 (1906, 'Male', 'John', 8265),
 (1907, 'Male', 'John', 8983),
 (1908, 'Male', 'John', 9342),
 (1909, 'Male', 'John', 9591),
 (1910, 'Male', 'John', 11450),
 (1911, 'Male', 'John', 13446),
 (1912, 'Male', 'John', 24587),
 (1913, 'Male', 'John', 29329),
 (1914, 'Male', 'John', 37948),
 (1915, 'Male', 'John', 47576),
 (1916, 'Male', 'John', 50043),
 (1917, 'Male', 'John', 51853),
 (1918, 'Male', 'John', 56558),
 (1919, 'Male', 'John', 53528),
 (1920, 'Male', 'John', 56913),
 (1921, 'Male', 'John', 58217),
 (1922, 'Male', 'John', 57277),
 (1923, 'Male', 'John', 57470),
 (1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1970, 'Female', 'Jennifer', 46157),
 (1971, 'Female', 'Jennifer', 56783),
 (1972, 'Female', 'Jennifer', 63603),
 (1973, 'Female', 'Jennifer', 62447),
 (1974, 'Female', 'Jennifer', 63114),
 (1975, 'Female', 'Jennifer', 58183),
 (1976, 'Female', 'Jennifer', 59474),
 (1977, 'Female', 'Jennifer', 58964),
 (1978, 'Female', 'Jennifer', 56321),
 (1979, 'Female', 'Jennifer', 56717),
 (1980, 'Female', 'Jennifer', 58375),
 (1981, 'Female', 'Jennifer', 57049),
 (1982, 'Female', 'Jennifer', 57117),
 (1983, 'Female', 'Jennifer', 54346),
 (1984, 'Female', 'Jennifer', 50559),
 (1985, 'Female', 'Jessica', 48347),
 (1986, 'Female', 'Jessica', 52677),
 (1987, 'Female', 'Jessica', 55994),
 (1988, 'Female', 'Jessica', 51543),
 (1989, 'Female', 'Jessica', 47884),
 (1990, 'Female', 'Jessica', 46475),
 (1993, 'Female', 'Jessica', 34987),
 (1994, 'Female', 'Jessica', 32117),
 (1995, 'Female', 'Jessica', 27938),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [39]:
%%sql
-- return baby names that start with "J" and end with "A"
SELECT * FROM topnames
WHERE name LIKE "J%A"

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1985, 'Female', 'Jessica', 48347),
 (1986, 'Female', 'Jessica', 52677),
 (1987, 'Female', 'Jessica', 55994),
 (1988, 'Female', 'Jessica', 51543),
 (1989, 'Female', 'Jessica', 47884),
 (1990, 'Female', 'Jessica', 46475),
 (1993, 'Female', 'Jessica', 34987),
 (1994, 'Female', 'Jessica', 32117),
 (1995, 'Female', 'Jessica', 27938)]

In [43]:
%%sql
-- return baby names that start with "J" that are 5 characters long
SELECT * FROM topnames
WHERE name LIKE 'J____'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [51]:
%%sql
-- returns countries with missing land obs
SELECT * FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CUW', 'Curacao', 'Latin America & Caribbean', 'High income', None),
 ('MAF', 'St. Martin (French part)', 'Latin America & Caribbean', 'High income', None),
 ('MCO', 'Monaco', 'Europe & Central Asia', 'High income', None),
 ('SDN', 'Sudan', 'Sub-Saharan Africa', 'Lower middle income', None),
 ('SSD', 'South Sudan', 'Sub-Saharan Africa', 'Low income', None),
 ('SXM', 'Sint Maarten (Dutch part)', 'Latin America & Caribbean', 'High income', None),
 ('XKX', 'Kosovo', 'Europe & Central Asia', 'Upper middle income', None)]

In [56]:
%%sql
-- returns countries that all include land obs
SELECT * FROM countries
WHERE land IS NOT NULL
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [59]:
%%sql
-- count how many rows exist in the entire countries table?
SELECT COUNT(*) AS total_obs FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217,)]

In [62]:
%%sql
-- count how many countries there are with missing land obs?
SELECT COUNT(*) AS missing_land FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(7,)]

In [65]:
%%sql
-- how many unique baby names exist in the topnames table?
SELECT COUNT(DISTINCT name) AS num_unique_names FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(18,)]

In [66]:
%%sql
-- return unique baby names in the topnames table
SELECT DISTINCT(name) FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Mary',),
 ('John',),
 ('Robert',),
 ('James',),
 ('Linda',),
 ('Michael',),
 ('David',),
 ('Lisa',),
 ('Jennifer',),
 ('Jessica',),
 ('Ashley',),
 ('Emily',),
 ('Jacob',),
 ('Emma',),
 ('Isabella',),
 ('Sophia',),
 ('Noah',),
 ('Liam',)]

In [68]:
%%sql
--create a new column named land_miles that contain miles squared values converted from the
-- km2 observations contained in the column "land"
SELECT *, land*0.3861 AS land_miles FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 69.498),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 252069.246),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 481350.87),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 10579.14),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 181.467)]

In [70]:
%%sql
-- create binary variable called large_country that equals 1 if land > 1000000
SELECT *, land>1000000 AS large_country FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 1),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 0)]

In [71]:
'Aruba' + ' ' + '(ABW)'

'Aruba (ABW)'

In [74]:
%%sql
-- create a new column called country2 that takes the form of 'country (code)'
-- + is "||" in SQL
SELECT *, country || ' (' || code || ')' AS country2 FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 'Aruba (ABW)'),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 'Afghanistan (AFG)'),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 'Angola (AGO)'),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 'Albania (ALB)'),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 'Andorra (AND)')]

In [79]:
%%sql
-- subqueries
-- return a table that contains the total number of obs and the number of missing land values
-- in the countries table
SELECT COUNT(*) AS total_obs, 
(SELECT COUNT(*) FROM countries WHERE land IS NULL) AS missing_land FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217, 7)]

In [84]:
%%sql
-- find the average land in countries table?
SELECT ROUND(AVG(land),2) AS avg_land FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(606227.81,)]

In [5]:
%%sql
-- another subquery practice:
-- filter the countries table such that the table returned only contains countries whose land
-- obs are larger than the average land obs in the table
SELECT * FROM countries
WHERE land > (SELECT AVG(land) FROM countries)

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0),
 ('BOL', 'Bolivia', 'Latin America & Caribbean', 'Lower middle income', 1083300.0),
 ('BRA', 'Brazil', 'Latin America & Caribbean', 'Upper middle income', 8358140.0),
 ('CAF', 'Central African Republic', 'Sub-Saharan Africa', 'Low income', 622980.0),
 ('CAN', 'Canada', 'North America', 'High income', 9093510.0),
 ('CHL', 'Chile', 'Latin America & Caribbean', 'High income', 743532.0),
 ('CHN', 'China', 'East Asia & Pacific', 'Upper middle income', 9388210.0),
 ('COD', 'Congo, Dem. Rep.', 'Sub-Saharan Africa', 'Low income', 2267050.0),
 ('COL', 'Colombia', 'Latin America & Caribbean', 'Upper middle income', 1109500.0),
 ('DZA', 'Algeria', 'Middle East & North Africa', 'Upper middle income', 2381740.0),
 ('EGY', 'Egypt, Arab Rep.', 'Middle East & North Africa', 'Lower middle income', 995450.0),
 ('ETH', 'Ethiopia', 'Sub-Saharan Africa', 'Low income', 1000000.0),
 ('IDN', 'Indonesia', 'East Asia & Pacific', 'Lower middle income', 1811570.0),
 ('IND', 'India', 'South Asia', 'Lower middle income', 2973190.0),
 ('IRN', 'Iran, Islamic Rep.', 'Middle East & North Africa', 'Upper middle income', 1628760.0),
 ('KAZ', 'Kazakhstan', 'Europe & Central Asia', 'Upper middle income', 2699700.0),
 ('LBY', 'Libya', 'Middle East & North Africa', 'Upper middle income', 1759540.0),
 ('MEX', 'Mexico', 'Latin America & Caribbean', 'Upper middle income', 1943950.0),
 ('MLI', 'Mali', 'Sub-Saharan Africa', 'Low income', 1220190.0),
 ('MMR', 'Myanmar', 'East Asia & Pacific', 'Lower middle income', 653080.0),
 ('MNG', 'Mongolia', 'East Asia & Pacific', 'Lower middle income', 1553560.0),
 ('MOZ', 'Mozambique', 'Sub-Saharan Africa', 'Low income', 786380.0),
 ('MRT', 'Mauritania', 'Sub-Saharan Africa', 'Lower middle income', 1030700.0),
 ('NAM', 'Namibia', 'Sub-Saharan Africa', 'Upper middle income', 823290.0),
 ('NER', 'Niger', 'Sub-Saharan Africa', 'Low income', 1266700.0),
 ('NGA', 'Nigeria', 'Sub-Saharan Africa', 'Lower middle income', 910770.0),
 ('PAK', 'Pakistan', 'South Asia', 'Lower middle income', 770880.0),
 ('PER', 'Peru', 'Latin America & Caribbean', 'Upper middle income', 1280000.0),
 ('RUS', 'Russian Federation', 'Europe & Central Asia', 'Upper middle income', 16376900.0),
 ('SAU', 'Saudi Arabia', 'Middle East & North Africa', 'High income', 2149690.0),
 ('SOM', 'Somalia', 'Sub-Saharan Africa', 'Low income', 627340.0),
 ('TCD', 'Chad', 'Sub-Saharan Africa', 'Low income', 1259200.0),
 ('TUR', 'Turkey', 'Europe & Central Asia', 'Upper middle income', 769630.0),
 ('TZA', 'Tanzania', 'Sub-Saharan Africa', 'Low income', 885800.0),
 ('USA', 'United States', 'North America', 'High income', 9147420.0),
 ('VEN', 'Venezuela, RB', 'Latin America & Caribbean', 'Upper middle income', 882050.0),
 ('ZAF', 'South Africa', 'Sub-Saharan Africa', 'Upper middle income', 1213090.0),
 ('ZMB', 'Zambia', 'Sub-Saharan Africa', 'Lower middle income', 743390.0)]

In [11]:
%%sql
-- return the countries whose gdp is great than the average gdp
-- of countries in 1990
-- return only for year 1990
SELECT * FROM indicators
WHERE gdp > (SELECT AVG(gdp) FROM indicators WHERE year=1990)
AND year=1990
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1990, 'ARG', 32.62, 141.35, 71.6, 0.01, 4078.48, 12352.0),
 (1990, 'AUS', 17.07, 310.77, 77.0, 0.18, 43051.4, 38982.5),
 (1990, 'AUT', 7.68, 166.46, 75.6, 0.07, 49287.2, 41389.8),
 (1990, 'BEL', 9.97, 206.43, 76.1, 0.04, None, None),
 (1990, 'BRA', 149.0, 461.95, 65.3, 0.0, 24977.3, 31388.9),
 (1990, 'CAN', 27.69, 593.93, 77.4, 0.58, 131641.0, 126441.0),
 (1990, 'CHE', 6.72, 258.07, 77.2, 0.13, 69703.8, 63797.4),
 (1990, 'CHN', 1135.18, 360.86, 69.3, 0.02, 53809.6, 62755.9),
 (1990, 'DEU', 79.43, 1764.97, 75.2, 0.27, 346415.0, 408874.0),
 (1990, 'DNK', 5.14, 138.25, 74.8, 0.15, 31371.7, 34030.1)]

In [14]:
%%sql
-- Find the "size of the earth" based on the land size
SELECT SUM(land) as total_land FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(127307840.0,)]

In [21]:
%%sql
-- total land size by region?
SELECT region, SUM(land) as total_land FROM countries
GROUP BY region
ORDER BY total_land DESC

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Europe & Central Asia', 27429254.6),
 ('East Asia & Pacific', 24361338.4),
 ('Sub-Saharan Africa', 21242361.0),
 ('Latin America & Caribbean', 20038832.0),
 ('North America', 18240984.0),
 ('Middle East & North Africa', 11223466.0),
 ('South Asia', 4771604.0)]

In [23]:
%%sql
-- What are top 10 largest countries in terms of land size?
SELECT country, land FROM countries
ORDER BY land DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Russian Federation', 16376900.0),
 ('China', 9388210.0),
 ('United States', 9147420.0),
 ('Canada', 9093510.0),
 ('Brazil', 8358140.0),
 ('Australia', 7692020.0),
 ('India', 2973190.0),
 ('Argentina', 2736690.0),
 ('Kazakhstan', 2699700.0),
 ('Algeria', 2381740.0)]

In [27]:
%%sql
-- if you need to filter groupby output:
SELECT region, SUM(land) as total_land FROM countries
GROUP BY region
HAVING total_land > 20000000
ORDER BY total_land DESC

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Europe & Central Asia', 27429254.6),
 ('East Asia & Pacific', 24361338.4),
 ('Sub-Saharan Africa', 21242361.0),
 ('Latin America & Caribbean', 20038832.0)]

In [29]:
%%sql
-- Return the top 10 most popular baby names that ever existed in the U.S.
-- Return the name, sex, and total count
SELECT name, sex, SUM(count) AS tot_count FROM topnames
GROUP BY name
ORDER BY tot_count DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Mary', 'Female', 3098428),
 ('Michael', 'Male', 3084824),
 ('James', 'Male', 1056228),
 ('Robert', 'Male', 1041984),
 ('John', 'Male', 861403),
 ('Jennifer', 'Female', 859209),
 ('Linda', 'Female', 508407),
 ('Lisa', 'Female', 420572),
 ('Jessica', 'Female', 397962),
 ('Jacob', 'Male', 370779)]

In [34]:
%%sql
-- Return the top 10 "oldest" baby names
-- Return their name, sex
SELECT name, sex, MIN(year) as first_appear FROM topnames
GROUP BY name
ORDER BY first_appear ASC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('John', 'Male', 1880),
 ('Mary', 'Female', 1880),
 ('Robert', 'Male', 1924),
 ('James', 'Male', 1940),
 ('Linda', 'Female', 1947),
 ('Michael', 'Male', 1954),
 ('David', 'Male', 1960),
 ('Lisa', 'Female', 1962),
 ('Jennifer', 'Female', 1970),
 ('Jessica', 'Female', 1985)]

In [38]:
%%sql
-- Alternate soltn:
-- Return the top 10 "oldest" baby names
-- Return their name, sex
SELECT name, sex, ROUND(AVG(year),2) as avg_appear FROM topnames
GROUP BY name
ORDER BY avg_appear ASC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('John', 'Male', 1901.5),
 ('Mary', 'Female', 1918.21),
 ('Robert', 'Male', 1932.76),
 ('James', 'Male', 1946.0),
 ('Linda', 'Female', 1949.5),
 ('David', 'Male', 1960.0),
 ('Lisa', 'Female', 1965.5),
 ('Michael', 'Male', 1976.36),
 ('Jennifer', 'Female', 1977.0),
 ('Jessica', 'Female', 1989.67)]

In [39]:
%%sql
-- Return the top 10 "newest" baby names
-- Return their name, sex
SELECT name, sex, ROUND(AVG(year),2) as avg_appear FROM topnames
GROUP BY name
ORDER BY avg_appear DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Liam', 'Male', 2017.5),
 ('Emma', 'Female', 2014.67),
 ('Noah', 'Male', 2014.5),
 ('Sophia', 'Female', 2012.0),
 ('Isabella', 'Female', 2009.5),
 ('Jacob', 'Male', 2005.5),
 ('Emily', 'Female', 2001.5),
 ('Ashley', 'Female', 1991.5),
 ('Jessica', 'Female', 1989.67),
 ('Jennifer', 'Female', 1977.0)]

In [2]:
%sql sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db

'Connected: @H:\\Dropbox\\git_website\\Data200_Fall24\\data\\school.db'

In [3]:
%sql SELECT name FROM sqlite_master where type='table'

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[('subjects',),
 ('instructors',),
 ('departments',),
 ('students',),
 ('courses',),
 ('classes',),
 ('instructor_class',),
 ('student_class',)]

In [35]:
%%sql
SELECT * FROM classes
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(40002, 'FALL', 'THTR', 100, '01', '09:30-10:20 MWF'),
 (40003, 'FALL', 'THTR', 110, '01', '14:30-17:50 M'),
 (40004, 'FALL', 'THTR', 120, '01', '10:00-11:20 TR'),
 (40005, 'FALL', 'THTR', 160, '01', None),
 (40006, 'FALL', 'THTR', 165, '01', None)]

In [44]:
%%sql
SELECT * FROM subjects
LIMIT 10

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ARAB', 'Arabic', 'LANG'),
 ('ARTH', 'Art History', 'ART'),
 ('ARTS', 'Art Studio', 'ART'),
 ('ASTR', 'Astronomy', 'PHYS'),
 ('BCHM', 'Biochemistry', 'CHEM'),
 ('BIOL', 'Biology', 'BIOL'),
 ('BLST', 'Black Studies', 'BLST'),
 ('CHEM', 'Chemistry', 'CHEM'),
 ('CHIN', 'Chinese', 'LANG'),
 ('CINE', 'Cinema', 'CINE')]

In [45]:
%%sql
SELECT * FROM departments
LIMIT 10

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ANSO', 'Anthropology and Sociology', None, 'Social Sciences'),
 ('ART', 'Art History and Visual Culture', 9252, 'Fine Arts'),
 ('BIOL', 'Biology', None, 'Natural Sciences'),
 ('BLST', 'Black Studies', 9133, 'Interdisciplinary'),
 ('CHEM', 'Chemistry and Biochemistry', 9143, 'Natural Sciences'),
 ('CINE', 'Cinema', 9042, 'Fine Arts'),
 ('CLAS', 'Classical Studies', 9111, 'Humanities'),
 ('COMM', 'Communication', 9144, 'Social Sciences'),
 ('DANC', 'Dance', 9180, 'Fine Arts'),
 ('EAST', 'East Asian Studies', 9257, 'Interdisciplinary')]

In [46]:
%%sql
SELECT * FROM instructors
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(9000, 'Brandon', 'Santos', 'ART', 'Granville', 'OH', 'Associate Professor, Art'),
 (9001, 'Margaux', 'Gillet', 'PHED', 'Granville', 'OH', 'Wellness Coordinator'),
 (9002, 'Tom', 'Werner', 'ENVS', 'Granville', 'OH', "Vis. Ass't. Prof, Env. Studies"),
 (9003, 'Roger', 'Davidson', 'SA', 'Columbus', 'OH', "Vis.Ass't Prof., Soc/Anthr, PT"),
 (9004, 'Sharon', 'Jimenez', 'LANG', 'Granville', 'OH', "Ass't Prof., Modern Languages")]

In [47]:
%%sql
--What is the name of the department chair of Art History and Visual Culture department?
-- (their id is 9252)
SELECT * FROM instructors
WHERE instructorid=9252

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(9252, 'Christine', 'Scott', 'ART', 'Granville', 'OH', 'Associate Professor, Art')]

In [48]:
%%sql
--What is the name of the department chair of Art History and Visual Culture department?
-- try a sub-query approach
SELECT * FROM instructors
WHERE instructorid=(SELECT departmentchair FROM departments 
                    WHERE departmentname="Art History and Visual Culture")

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(9252, 'Christine', 'Scott', 'ART', 'Granville', 'OH', 'Associate Professor, Art')]

In [10]:
%%sql
-- Get the names of department chair, and the names of the department they are chairing for all departments
SELECT departmentname, instructorfirst, instructorlast FROM departments
INNER JOIN instructors
ON departments.departmentchair = instructors.instructorid
LIMIT 3

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[('Art History and Visual Culture', 'Christine', 'Scott'),
 ('Black Studies', 'Aarav', 'Jhadav'),
 ('Chemistry and Biochemistry', 'Judith', 'Burton')]

In [34]:
%%sql
-- Return the instructor the data for the instructors who are teaching the following four classes with classid
-- 21014,21088,21256,21444, including the instructors' id, first and last name, their departmentid and the division
-- that their department is in.
-- Hint: you will need three tables.
-- instructors, departments on: departmentid
-- instructor_class on: instructorid
-- before the second join, the level of the data is at the instructor level, after the second join it becomes section level
SELECT instructorfirst,instructorlast,departmentid,division,classid FROM instructors
INNER JOIN departments
USING(departmentid)
INNER JOIN instructor_class
USING(instructorid)
WHERE classid IN (21014,21088,21256,21444)
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[('Helen', 'Foster', 'PSYC', 'Natural Sciences', 21014),
 ('Grace', 'Hawkins', 'PHIL', 'Humanities', 21088),
 ('Jason', 'Garrett', 'ECON', 'Social Sciences', 21256),
 ('Taylor', 'Price', 'PHED', 'Social Sciences', 21444)]

In [20]:
%%sql
-- For the classes with classid 21014,21088,21256,21444, return a table with the following format:
-- Column1: 4lettersubjectname-coursenumber-section
-- Column2: Class meeting time
-- Hint: "||" is used instead of "+" in SQL
SELECT coursesubject || "-" || coursenum || "-" || classsection AS classinfo, classmeeting, COUNT(studentid) AS enrollment
FROM classes
INNER JOIN student_class
USING(classid)
GROUP BY classid
ORDER BY classmeeting DESC
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('DANC-420-01', '20:30-22:20 TR', 18),
 ('DANC-430-01', '20:30-22:20 MW', 5),
 ('DANC-450-01', '20:30-22:20 MW', 20),
 ('MUSP-138-01', '20:00-22:00 T', 17),
 ('MUSP-138-01', '20:00-22:00 R', 15)]

In [17]:
%%sql
-- Extend the table above such that there is a Column3: student enrollment
-- Hints: GROUP BY and COUNT()
SELECT classid, COUNT(studentid) AS enrollment FROM student_class
--WHERE status == '**Registered**'
WHERE status LIKE '%Registered%'
GROUP BY classid
LIMIT 25

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(21002, 7),
 (21003, 85),
 (21004, 6),
 (21007, 2),
 (21008, 4),
 (21013, 18),
 (21014, 20),
 (21015, 30),
 (21016, 27),
 (21017, 20),
 (21018, 20),
 (21019, 20),
 (21020, 20),
 (21021, 16),
 (21022, 25),
 (21023, 28),
 (21024, 22),
 (21025, 13),
 (21026, 24),
 (21027, 13),
 (21028, 28),
 (21029, 14),
 (21030, 24),
 (21031, 12),
 (21032, 15)]

In [21]:
%%sql
-- Is there a "Data" major being offered in this college?
SELECT name FROM sqlite_master where type='table'

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('subjects',),
 ('instructors',),
 ('departments',),
 ('students',),
 ('courses',),
 ('classes',),
 ('instructor_class',),
 ('student_class',)]

In [27]:
%%sql
-- Data as a major doesn't exist at this college
SELECT * FROM subjects
WHERE subjectname LIKE 'Data%'
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[]

In [29]:
%%sql
-- But, do they teach data classes in this college?
SELECT * FROM courses
WHERE coursetitle LIKE '%Data%'
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CS', 271, 'Data Structures', 4.0)]

In [45]:
%%sql
-- What are the most popular and least popular class meeting times?
-- 1) use student enrollment
SELECT classmeeting, COUNT(studentid) AS enrollment, COUNT(DISTINCT classid) AS num_sections FROM student_class
INNER JOIN classes
USING(classid)
WHERE status LIKE '%Registered%' AND classmeeting IS NOT NULL
GROUP BY classmeeting
ORDER BY enrollment DESC


-- 2) use number of sections available in each meeting time (show num_sections as a third column) (see above)

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('09:30-10:20 MWF', 1446, 80),
 ('10:00-11:20 TR', 1435, 95),
 ('10:30-11:20 MWF', 1304, 68),
 ('11:30-12:20 MWF', 1269, 63),
 ('13:30-14:50 TR', 1146, 72),
 ('12:30-13:20 MWF', 1093, 57),
 ('13:30-14:20 MWF', 669, 38),
 ('14:30-15:50 MW', 631, 42),
 ('08:30-09:20 MWF', 596, 32),
 ('11:30-12:20 MTWF', 496, 31),
 ('15:00-16:20 TR', 494, 32),
 ('09:30-10:20 MWRF', 476, 30),
 ('08:30-09:50 TR', 422, 22),
 ('11:30-13:20 MW', 415, 34),
 ('10:30-11:20 MWRF', 411, 24),
 ('12:30-13:20 MTWF', 298, 18),
 ('08:30-09:20 MWRF', 283, 16),
 ('10:30-11:20 MTWF', 229, 10),
 ('14:30-15:20 MWF', 209, 10),
 ('11:30-12:50 MW', 161, 10),
 ('08:30-10:20 MW', 157, 12),
 ('16:30-18:00 TR', 150, 4),
 ('15:30-16:20 MW', 131, 4),
 ('14:30-16:20 MW', 127, 9),
 ('15:30-16:20 TR', 125, 9),
 ('16:30-18:30 W', 116, 5),
 ('16:30-17:50 TR', 108, 6),
 ('19:00-20:30 M', 107, 2),
 ('09:00-10:20 MW', 102, 4),
 ('13:30-14:20 MTWF', 99, 7),
 ('09:30-10:20 MTWF', 98, 5),
 ('16:30-17:20 M', 89, 3),
 ('13:30-14:20 TR', 87, 8),
 ('18:30-20:30 M', 80, 2),
 ('09:30-11:20 TR', 75, 8),
 ('11:30-13:20 T', 71, 6),
 ('16:30-18:00 MW', 67, 3),
 ('13:30-16:20 MW', 65, 5),
 ('08:30-09:20 MTWF', 64, 3),
 ('15:00-16:50 TR', 63, 5),
 ('14:30-16:50 M', 61, 6),
 ('14:30-16:30 F', 59, 2),
 ('14:30-16:20 M', 59, 4),
 ('13:30-14:20 MWRF', 58, 4),
 ('17:30-18:20 W', 55, 1),
 ('17:30-18:20 R', 51, 1),
 ('16:30-17:50 MW', 51, 2),
 ('13:30-16:20 TR', 51, 3),
 ('18:30-19:50 TR', 50, 2),
 ('11:30-12:20 TR', 50, 2),
 ('08:30-09:20 MTWRF', 48, 3),
 ('14:30-15:20 MF', 45, 3),
 ('09:30-11:20 MW', 45, 3),
 ('09:00-11:20 T', 45, 4),
 ('18:30-19:50 MW', 44, 4),
 ('16:30-17:20 W', 42, 1),
 ('16:30-18:20 MW', 39, 3),
 ('14:30-16:20 W', 38, 3),
 ('13:30-14:50 MW', 35, 2),
 ('11:30-13:20 TF', 31, 2),
 ('14:30-15:20 MW', 29, 2),
 ('10:30-11:20 TR', 29, 3),
 ('09:30-11:20 MWF', 29, 3),
 ('13:30-16:20 R', 28, 2),
 ('08:30-11:20 MW', 28, 3),
 ('17:00-18:20 TR', 27, 1),
 ('12:30-13:20 MW', 27, 3),
 ('18:30-20:30 W', 26, 1),
 ('15:00-17:20 T', 26, 3),
 ('08:30-10:50 T', 26, 2),
 ('15:00-16:50 T', 25, 2),
 ('15:00-16:50 R', 24, 2),
 ('14:30-16:50 W', 24, 2),
 ('13:30-16:50 F', 24, 2),
 ('13:30-14:20 W', 24, 2),
 ('20:30-22:20 MW', 23, 2),
 ('14:30-15:20 TR', 23, 3),
 ('13:30-15:20 T', 22, 1),
 ('18:30-20:20 MW', 21, 2),
 ('18:00-19:30 TR', 21, 1),
 ('15:30-16:50 TR', 20, 1),
 ('13:30-14:50 T', 19, 2),
 ('11:30-13:00 T', 19, 2),
 ('20:30-22:20 TR', 18, 1),
 ('14:30-17:50 M', 18, 1),
 ('13:30-15:20 TR', 18, 1),
 ('08:30-12:20 T', 18, 2),
 ('18:30-20:20 TR', 17, 2),
 ('15:00-17:00 TR', 17, 1),
 ('13:30-16:50 M', 17, 1),
 ('10:00-11:20 T', 17, 2),
 ('18:30-20:50 T', 16, 1),
 ('18:00-22:00 T', 16, 1),
 ('16:30-18:30 MW', 16, 1),
 ('14:30-17:20 W', 16, 2),
 ('16:30-17:20 MW', 15, 2),
 ('20:00-22:00 T', 14, 1),
 ('20:00-22:00 R', 14, 1),
 ('15:30-16:20 T', 14, 1),
 ('14:30-16:20 MWF', 14, 2),
 ('13:30-16:20 W', 14, 1),
 ('08:30-10:20 W', 14, 1),
 ('09:00-11:20 TR', 13, 1),
 ('16:30-18:00 T', 12, 2),
 ('16:30-18:00 M', 12, 1),
 ('14:30-16:20 T', 12, 1),
 ('14:30-16:00 MW', 12, 1),
 ('14:30-15:20 T', 12, 2),
 ('10:30-11:20 MTWRF', 12, 2),
 ('08:30-09:20 MW', 12, 1),
 ('15:30-16:20 W', 10, 1),
 ('15:30-16:20 R', 10, 1),
 ('15:00-17:20 R', 10, 1),
 ('13:30-14:50 M', 10, 1),
 ('18:30-21:30 R', 9, 1),
 ('12:30-14:20 MW', 9, 1),
 ('10:30-12:20 MWF', 9, 1),
 ('18:00-20:00 T', 8, 1),
 ('16:00-17:00 W', 8, 1),
 ('14:30-15:20 F', 8, 2),
 ('09:30-10:20 TR', 8, 1),
 ('13:30-16:50 TR', 7, 1),
 ('15:00-17:20 W', 6, 1),
 ('14:30-15:20 MWRF', 6, 1),
 ('13:30-14:20 M', 6, 2),
 ('11:30-14:20 F', 6, 1),
 ('11:30-12:20 MW', 6, 1),
 ('10:30-11:20 MW', 5, 1),
 ('13:30-16:20 T', 4, 1),
 ('13:30-14:50 R', 4, 1),
 ('13:30-14:20 MTWRF', 4, 1),
 ('18:00-19:30 M', 3, 1),
 ('18:00-19:20 M', 3, 1),
 ('09:30-10:20 MTWRF', 3, 1),
 ('10:30-11:20 T', 2, 2)]

In [50]:
%%sql
-- Return the most dropped classes
SELECT classid, COUNT(classid) AS num_drops FROM student_class
WHERE status LIKE '%Drop%'
GROUP BY classid
ORDER BY num_drops DESC
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
   sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(40288, 24), (21416, 24), (21443, 23), (40151, 22), (21567, 22)]

In [20]:
%%sql
-- return the total number of classes the students have taken in this college
SELECT studentid, COUNT(classid) AS num_classes FROM student_class
GROUP BY studentid
ORDER BY num_classes DESC
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(61892, 27), (61774, 25), (62815, 25), (61777, 24), (62945, 24)]

In [33]:
%%sql
-- return enrollment by classterm (num registrations and num sections)
SELECT classterm, COUNT(studentid) AS enrollment, COUNT(DISTINCT classid) AS sections FROM classes
INNER JOIN student_class USING(classid)
GROUP BY classterm
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[('FALL', 11898, 888), ('SPRING', 11012, 912)]

In [34]:
%%sql
-- How many students in total are there in this college?
SELECT COUNT(studentid) AS total_count FROM students

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(2274,)]

In [47]:
%%sql
-- What is the female/total ratio?
-- Uses subquery
SELECT ROUND(1.0*female/total,3) AS female_ratio FROM
(SELECT COUNT(studentid) AS total, SUM(studentgender='F') AS female FROM students)

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(0.496,)]

In [50]:
%%sql
-- What is the female/total ratio?
-- Wo subquery
SELECT ROUND(1.0*SUM(studentgender='F')/COUNT(studentid),3) AS female_ratio FROM students

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(0.496,)]

In [56]:
%%sql
-- Note: SUBSTRING() func:
SELECT *, SUBSTRING(studentfirst,1,1) AS firstnameinitial FROM students
LIMIT 5

 * sqlite:///C:\Users\Bilene\Downloads\school.db
Done.

[(61500, 'Gary', 'Ortega', None, None, 'M', 'Multiple', None, 'G'),
 (61501, 'Ayaan', 'Sarin', 'Newark', 'OH', 'M', 'White', None, 'A'),
 (61502, 'Jacob', 'Hoffman', 'Granville', 'OH', 'M', 'White', None, 'J'),
 (61503, 'Sara', 'Hart', 'Granville', 'OH', 'F', 'White', None, 'S'),
 (61504, 'Harini', 'Kapur', 'Pataskala', 'OH', 'F', 'White', None, 'H')]

In [ ]:
%%sql
-- Note: Filtering on a date
-- Suppose students table had a dob column: '2000-01-31'
-- If you wanted to students whose dob is great than '2002-03-21'
SELECT * FROM students
WHERE dob > '2002-03-21'

In [6]:
%%sql
-- How many undeclared students are there?
SELECT COUNT(studentid) AS undeclared FROM students
WHERE studentmajor IS NULL

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[(252,)]

In [14]:
%%sql
-- How many student majors does each department have?
SELECT studentmajor, COUNT(studentid) AS num_majors FROM students
GROUP BY studentmajor
LIMIT 5

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[(None, 252), ('ARTH', 17), ('ARTS', 42), ('BCHM', 44), ('BIOL', 237)]

In [8]:
%%sql
-- How many students do each department teach to?
SELECT departmentid,COUNT(studentid) AS student_enrollment FROM classes
INNER JOIN subjects ON subjects.subjectid=classes.coursesubject
INNER JOIN student_class USING(classid)
WHERE status LIKE '%Registered%'
GROUP BY departmentid
ORDER BY student_enrollment DESC
LIMIT 5

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[('LANG', 2061), ('MUS', 1843), ('PHED', 1280), ('FYS', 1200), ('ECON', 1171)]

In [9]:
%%sql
--How many departments are there by division?
SELECT division, COUNT(departmentid) AS num_depts FROM departments
GROUP BY division

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[('Fine Arts', 5),
 ('Humanities', 6),
 ('Interdisciplinary', 13),
 ('Natural Sciences', 6),
 ('Social Sciences', 6)]

In [19]:
%%sql
--How many departments are there by division?
SELECT * FROM instructors
LIMIT 5

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[(9000, 'Brandon', 'Santos', 'ART', 'Granville', 'OH', 'Associate Professor, Art'),
 (9001, 'Margaux', 'Gillet', 'PHED', 'Granville', 'OH', 'Wellness Coordinator'),
 (9002, 'Tom', 'Werner', 'ENVS', 'Granville', 'OH', "Vis. Ass't. Prof, Env. Studies"),
 (9003, 'Roger', 'Davidson', 'SA', 'Columbus', 'OH', "Vis.Ass't Prof., Soc/Anthr, PT"),
 (9004, 'Sharon', 'Jimenez', 'LANG', 'Granville', 'OH', "Ass't Prof., Modern Languages")]

In [23]:
%%sql
--How many courses does each faculty member teach?
SELECT instructorid, instructorfirst, instructorlast, COUNT(classid) AS num_courses FROM instructors
INNER JOIN instructor_class USING(instructorid)
GROUP BY instructorid
LIMIT 5

 * sqlite:///H:\Dropbox\git_website\Data200_Fall24\data\school.db
Done.

[(9000, 'Brandon', 'Santos', 4),
 (9001, 'Margaux', 'Gillet', 1),
 (9002, 'Tom', 'Werner', 4),
 (9003, 'Roger', 'Davidson', 1),
 (9004, 'Sharon', 'Jimenez', 6)]

In [ ]:
########

In [2]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [3]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [5]:
%%sql 
SELECT * FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [6]:
%%sql 
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]

In [9]:
%%sql
-- we can use USING(code) because the key variable has the same col name across both tables
SELECT * FROM countries
LEFT JOIN indicators
USING(code)
WHERE pop IS NULL
GROUP BY code

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ERI', 'Eritrea', 'Sub-Saharan Africa', 'Low income', 101000.0, 2012, None, None, 63.2, 0.31, 632.23, 207.71),
 ('KWT', 'Kuwait', 'Middle East & North Africa', 'High income', 17820.0, 1992, None, 19.86, 72.4, 0.05, 7259.1, 4547.76),
 ('PSE', 'West Bank and Gaza', 'Middle East & North Africa', 'Lower middle income', 6020.0, 1960, None, None, None, None, None, None),
 ('SRB', 'Serbia', 'Europe & Central Asia', 'Upper middle income', 87460.0, 1960, None, None, None, None, None, None),
 ('SXM', 'Sint Maarten (Dutch part)', 'Latin America & Caribbean', 'High income', None, 1960, None, None, None, None, None, None)]

In [11]:
%%sql
-- other way around, return countries whose data is available from the indicators table, but they
-- have missing income observations from the countries table
SELECT * FROM indicators
LEFT JOIN countries
USING(code)
WHERE income IS NULL
GROUP BY code

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'INX', None, None, None, None, None, None, None, None, None, None)]

In [12]:
%%sql
SELECT * FROM countries
FULL OUTER JOIN indicators
USING(code)
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 1960, 0.05, None, 65.7, 0.0, None, None),
 ('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 1961, 0.06, None, 66.1, None, None, None),
 ('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 1962, 0.06, None, 66.4, None, None, None),
 ('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 1963, 0.06, None, 66.8, None, None, None),
 ('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 1964, 0.06, None, 67.1, None, None, None)]